#Даны 2 действительных числа a и b. Получить их сумму, разность ипроизведение
a = -5
b = 7
print("Result: ", a + b)
print("Result: ", a - b)
print("Result: ", a * b)
