#Дана длина ребра куба. Найти объем куба и площадь его боковойповерхности
d = 2
v = d ** 3
print("Объем: ", v)
print("Площадь: ", d ** 2)