#Даны два действительных числа. Найти среднее арифметическое исреднее геометрическое этих чисел
n = 7
m = 8
result1 = (n + m) / 2
print(result1)
result2 = (n * m) ** (1 / 2)
print(round(result2, 1))